MonotonicityTypes.org
#+AUTHOR: Wiebe-Marten Wijnja
#+PROPERTY: header-args :comment org

* Introduction

Dear Kevin Clancy, Heather Miller and Christopher Meiklejohn.

I very much enjoyed reading your whitepaper titled *Monotonicity Types*.
While reading I more and more got the suspicion that it might be possible to implement the essence of Monotonicity Types today in Haskell,
foregoing the need to build a completely separate language and compiler to annotate functions as monotonic, antitonic or neither.

This turned out to be a bit of a challenge, and I learned a lot about the dependently typed features that Haskell (provided you enable some GHC extensions) offers.
I believe the end result to be usable/practical today.

In this literate haskell document, I'll explain the implementation details.
As literate haskell, this org-mode document can be read both as LaTeX-PDF as well as Haskell source code.


* Preamble
:PROPERTIES:
:header-args: :tangle MonotonicityTypes.hs
:END:

As you can see, we require quite a few extensions. Why we need them will be explained when we require them.
#+BEGIN_SRC haskell
{-# LANGUAGE DataKinds  #-}
{-# LANGUAGE KindSignatures  #-}
{-# LANGUAGE TypeFamilies  #-}
{-# LANGUAGE PolyKinds  #-}
{-# LANGUAGE GADTs  #-}

#+END_SRC

Now for the head of the module:

#+BEGIN_SRC haskell
module MonotonicityTypes where

import qualified Prelude
import Prelude hiding (id, (.))
import qualified Control.Category
import qualified Control.Arrow
#+END_SRC

