MonotonicityTypes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-09 zo 13:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wiebe-Marten Wijnja" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd8d42b8">1. Introduction</a></li>
<li><a href="#orgc9ccd6a">2. Preamble</a></li>
<li><a href="#orga7eea28">3. Building Sfuns as types that change under composition</a></li>
<li><a href="#orgb5623d9">4. Handling multi-parameter functions</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd8d42b8" class="outline-2">
<h2 id="orgd8d42b8"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Dear Kevin Clancy, Heather Miller and Christopher Meiklejohn.
</p>

<p>
I very much enjoyed reading your whitepaper titled <b>Monotonicity Types</b>.
While reading I more and more got the suspicion that it might be possible to implement the essence of Monotonicity Types today in Haskell,
foregoing the need to build a completely separate language and compiler to annotate functions as monotonic, antitonic or neither.
</p>

<p>
This turned out to be a bit of a challenge, and I learned a lot about the dependently typed features that Haskell (provided you enable some GHC extensions) offers.
I believe the end result to be usable/practical today.
</p>

<p>
In this literate haskell document, I'll explain the implementation details.
As literate haskell, this org-mode document can be read both as LaTeX-PDF as well as Haskell source code.
</p>
</div>
</div>


<div id="outline-container-orgc9ccd6a" class="outline-2">
<h2 id="orgc9ccd6a"><span class="section-number-2">2</span> Preamble</h2>
<div class="outline-text-2" id="text-2">
<p>
As you can see, we require quite a few extensions. Why we need them will be explained when we require them.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5;">{-# LANGUAGE DataKinds  #-}</span>
<span style="color: #bc6ec5;">{-# LANGUAGE KindSignatures  #-}</span>
<span style="color: #bc6ec5;">{-# LANGUAGE TypeFamilies  #-}</span>
<span style="color: #bc6ec5;">{-# LANGUAGE PolyKinds  #-}</span>
<span style="color: #bc6ec5;">{-# LANGUAGE GADTs  #-}</span>

</pre>
</div>

<p>
Now for the head of the module:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #ce537a; font-weight: bold;">MonotonicityTypes</span> <span style="color: #4f97d7; font-weight: bold;">where</span>

<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7; font-weight: bold;">qualified</span> <span style="color: #ce537a; font-weight: bold;">Prelude</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #ce537a; font-weight: bold;">Prelude</span> <span style="color: #4f97d7; font-weight: bold;">hiding</span> <span style="color: #4f97d7;">(</span>id, <span style="color: #bc6ec5;">(</span><span style="color: #7590db;">.</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7; font-weight: bold;">qualified</span> <span style="color: #ce537a; font-weight: bold;">Control.Category</span>
<span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #4f97d7; font-weight: bold;">qualified</span> <span style="color: #ce537a; font-weight: bold;">Control.Arrow</span>
</pre>
</div>
</div>
</div>
