MonotonicityTypes.tex
% Created 2019-06-09 zo 13:35
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Wiebe-Marten Wijnja}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Wiebe-Marten Wijnja},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.2 (Org mode 9.2.2)}, 
 pdflang={English}}
\begin{document}

\tableofcontents


\section{Introduction}
\label{sec:org2246baf}

Dear Kevin Clancy, Heather Miller and Christopher Meiklejohn.

I very much enjoyed reading your whitepaper titled \textbf{Monotonicity Types}.
While reading I more and more got the suspicion that it might be possible to implement the essence of Monotonicity Types today in Haskell,
foregoing the need to build a completely separate language and compiler to annotate functions as monotonic, antitonic or neither.

This turned out to be a bit of a challenge, and I learned a lot about the dependently typed features that Haskell (provided you enable some GHC extensions) offers.
I believe the end result to be usable/practical today.

In this literate haskell document, I'll explain the implementation details.
As literate haskell, this org-mode document can be read both as \LaTeX{}-PDF as well as Haskell source code.


\section{Preamble}
\label{sec:orge93588e}
As you can see, we require quite a few extensions. Why we need them will be explained when we require them.
\begin{verbatim}
{-# LANGUAGE DataKinds  #-}
{-# LANGUAGE KindSignatures  #-}
{-# LANGUAGE TypeFamilies  #-}
{-# LANGUAGE PolyKinds  #-}
{-# LANGUAGE GADTs  #-}

\end{verbatim}

Now for the head of the module:

\begin{verbatim}
module MonotonicityTypes where

import qualified Prelude
import Prelude hiding (id, (.))
import qualified Control.Category
import qualified Control.Arrow
\end{verbatim}
