MonotonicityTypes.html

<div id="outline-container-orga7eea28" class="outline-2">
<h2 id="orga7eea28"><span class="section-number-2">3</span> Building Sfuns as types that change under composition</h2>
<div class="outline-text-2" id="text-3">
<p>
Let us start by defining a datatype for the different tonicity qualifiers that we want to support.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #2aa1ae;">{-| Tonicity Qualifiers from section 4.2 of the paper.-}</span>
<span style="color: #4f97d7; font-weight: bold;">data</span> <span style="color: #ce537a; font-weight: bold;">TonicityQualifier</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Constant</span> <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">Monotone</span> <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">Antitone</span> <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">Unknown</span> <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">Discarded</span>
</pre>
</div>

<p>
But rather than using these as values, we will use them at the type level, restricting the type of <b>Sfuns</b>:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #4f97d7; font-weight: bold;">newtype</span> <span style="color: #ce537a; font-weight: bold;">Sfun</span> <span style="color: #4f97d7;">(</span>t <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">TonicityQualifier</span><span style="color: #4f97d7;">)</span> input output <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">UnsafeMakeSfun</span> <span style="color: #4f97d7;">{</span> applySfun <span style="color: #7590db;">::</span> input <span style="color: #7590db;">-&gt;</span> output <span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Besides being restricted by `t`, Sfuns are normal functions.
By declaring `UnsafeMakeSfun` as 'unsafe', people are discouraged from using it (but can still do so if they really know what they are doing).
We use it to tag the primitive functions that we know are monotone as such:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">A few examples:</span>
<span style="color: #bc6ec5; font-weight: bold;">incrementSfun</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Num</span> a <span style="color: #7590db;">=&gt;</span> <span style="color: #ce537a; font-weight: bold;">Sfun</span> '<span style="color: #ce537a; font-weight: bold;">Monotone</span> a a
<span style="color: #bc6ec5; font-weight: bold;">incrementSfun</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">UnsafeMakeSfun</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">+</span> <span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>

<span style="color: #bc6ec5; font-weight: bold;">negateSfun</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Num</span> a <span style="color: #7590db;">=&gt;</span> <span style="color: #ce537a; font-weight: bold;">Sfun</span> '<span style="color: #ce537a; font-weight: bold;">Antitone</span> a a
<span style="color: #bc6ec5; font-weight: bold;">negateSfun</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">UnsafeMakeSfun</span> <span style="color: #4f97d7;">(</span><span style="color: #7590db;">*</span> <span style="color: #bc6ec5;">(</span><span style="color: #7590db;">-</span><span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

</pre>
</div>

<p>
Normally, people will instead compose Sfuns together, which will result in an Sfun type that is their composition, as per figure 6 in the paper:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">The composition of two Sfuns is the composition of their two functions,</span>
<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">but with the type restricted to the composition of their tonicity qualifiers.</span>
<span style="color: #bc6ec5; font-weight: bold;">composeSfuns</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Sfun</span> t1 b c <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Sfun</span> t2 a b <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Sfun</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ComposeTonicity</span> t1 t2<span style="color: #4f97d7;">)</span> a c
<span style="color: #bc6ec5; font-weight: bold;">composeSfuns</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">UnsafeMakeSfun</span> f<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">UnsafeMakeSfun</span> g<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">UnsafeMakeSfun</span> <span style="color: #4f97d7;">(</span>f <span style="color: #7590db;">Prelude..</span> g<span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #4f97d7; font-weight: bold;">family</span> <span style="color: #ce537a; font-weight: bold;">ComposeTonicity</span> <span style="color: #4f97d7;">(</span>t1 <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">TonicityQualifier</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span>t2 <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">TonicityQualifier</span><span style="color: #4f97d7;">)</span>  <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">TonicityQualifier</span> <span style="color: #4f97d7; font-weight: bold;">where</span>
  <span style="color: #ce537a; font-weight: bold;">ComposeTonicity</span> '<span style="color: #ce537a; font-weight: bold;">Monotone</span> '<span style="color: #ce537a; font-weight: bold;">Monotone</span> <span style="color: #7590db;">=</span> '<span style="color: #ce537a; font-weight: bold;">Monotone</span>
  <span style="color: #ce537a; font-weight: bold;">ComposeTonicity</span> '<span style="color: #ce537a; font-weight: bold;">Monotone</span> '<span style="color: #ce537a; font-weight: bold;">Antitone</span> <span style="color: #7590db;">=</span> '<span style="color: #ce537a; font-weight: bold;">Antitone</span>
  <span style="color: #ce537a; font-weight: bold;">ComposeTonicity</span> '<span style="color: #ce537a; font-weight: bold;">Antitone</span> '<span style="color: #ce537a; font-weight: bold;">Antitone</span> <span style="color: #7590db;">=</span> '<span style="color: #ce537a; font-weight: bold;">Monotone</span>
  <span style="color: #ce537a; font-weight: bold;">ComposeTonicity</span> '<span style="color: #ce537a; font-weight: bold;">Antitone</span> '<span style="color: #ce537a; font-weight: bold;">Monotone</span> <span style="color: #7590db;">=</span> '<span style="color: #ce537a; font-weight: bold;">Antitone</span>
  <span style="color: #ce537a; font-weight: bold;">ComposeTonicity</span> '<span style="color: #ce537a; font-weight: bold;">Constant</span> other <span style="color: #7590db;">=</span> other
  <span style="color: #ce537a; font-weight: bold;">ComposeTonicity</span> other '<span style="color: #ce537a; font-weight: bold;">Constant</span> <span style="color: #7590db;">=</span> other
  <span style="color: #ce537a; font-weight: bold;">ComposeTonicity</span> '<span style="color: #ce537a; font-weight: bold;">Discarded</span> <span style="color: #4f97d7; font-weight: bold;">_</span> <span style="color: #7590db;">=</span> '<span style="color: #ce537a; font-weight: bold;">Discarded</span>
  <span style="color: #ce537a; font-weight: bold;">ComposeTonicity</span> <span style="color: #4f97d7; font-weight: bold;">_</span> '<span style="color: #ce537a; font-weight: bold;">Discarded</span> <span style="color: #7590db;">=</span> '<span style="color: #ce537a; font-weight: bold;">Discarded</span>
  <span style="color: #ce537a; font-weight: bold;">ComposeTonicity</span> <span style="color: #4f97d7; font-weight: bold;">_</span> <span style="color: #4f97d7; font-weight: bold;">_</span> <span style="color: #7590db;">=</span> '<span style="color: #ce537a; font-weight: bold;">Unknown</span>

</pre>
</div>

<p>
Now that we have defined composition, we can compose our sfuns as follows:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">result1 :: Num a =&gt; Sfun 'Monotone a a</span>
<span style="color: #bc6ec5; font-weight: bold;">result1</span> <span style="color: #7590db;">=</span> composeSfuns incrementSfun incrementSfun

<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">result2 :: Num a =&gt; Sfun 'Antitone a a</span>
<span style="color: #bc6ec5; font-weight: bold;">result2</span> <span style="color: #7590db;">=</span> composeSfuns negateSfun incrementSfun

<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">result3 :: Num a =&gt; Sfun 'Antitone a a</span>
<span style="color: #bc6ec5; font-weight: bold;">result3</span> <span style="color: #7590db;">=</span> composeSfuns incrementSfun negateSfun

<span style="color: #2aa1ae; background-color: #292e34;">-- </span><span style="color: #2aa1ae; background-color: #292e34;">result4 :: Num a =&gt; Sfun 'Monotone a a</span>
<span style="color: #bc6ec5; font-weight: bold;">result4</span> <span style="color: #7590db;">=</span> composeSfuns negateSfun negateSfun

</pre>
</div>

<p>
Those type signatures are inferred. If you were to try for instance to write
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">result4'</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Num</span> a <span style="color: #7590db;">=&gt;</span> <span style="color: #ce537a; font-weight: bold;">Sfun</span> '<span style="color: #ce537a; font-weight: bold;">Antitone</span> a a
<span style="color: #bc6ec5; font-weight: bold;">result4'</span> <span style="color: #7590db;">=</span> composeSfuns negateSfun negateSfun
</pre>
</div>

<p>
then GHC will complain with a nice error:
</p>

<div class="org-src-container">
<pre class="src src-text">&#8226; Couldn't match type &#8216;'Monotone&#8217; with &#8216;'Antitone&#8217;
  Expected type: Sfun 'Antitone a a
    Actual type: Sfun (ComposeTonicity 'Antitone 'Antitone) a a
&#8226; In the expression: composeSfuns negateSfun negateSfun
  In an equation for &#8216;result4&#8217;:
      result4 = composeSfuns negateSfun negateSfun
</pre>
</div>

<p>
The foundation is there. However, to make this somewhat usable, we need to make it as seamless to use Sfuns:
To the user of the library, the fact that these functions are 'special' should mostly be hidden!
</p>

<p>
It can be recognized that Sfuns are almost an instance of Arrow: The fact that the type might change under composition
is not something that the normal Arrow typeclass can cope with.
</p>

<p>
Instead, we implement an 'Indexed Category' and an 'Indexed Arrow', which explicity captures this notion of types being able to change under composition.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #2aa1ae;">-- | Behaves to `Control.Category` but has an extra `index` kind parameter,</span>
<span style="color: #2aa1ae;">-- | whose type-value might change under composition.</span>
<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">IndexedCategory</span> <span style="color: #4f97d7;">(</span>ic <span style="color: #7590db;">::</span> index <span style="color: #7590db;">-&gt;</span> <span style="color: #7590db;">*</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #7590db;">*</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #7590db;">*</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">where</span>
  <span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">ComposeIndexes</span> <span style="color: #4f97d7;">(</span>index1 <span style="color: #7590db;">::</span> index<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span>index2 <span style="color: #7590db;">::</span> index<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">::</span> index <span style="color: #2aa1ae;">-- ^ The resulting type under composition</span>
  id <span style="color: #7590db;">::</span> ic <span style="color: #4f97d7;">(</span>index' <span style="color: #7590db;">::</span> index<span style="color: #4f97d7;">)</span> a a
  <span style="color: #4f97d7;">(</span><span style="color: #7590db;">.</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">::</span> ic i1 b c <span style="color: #7590db;">-&gt;</span> ic i2 a b <span style="color: #7590db;">-&gt;</span> ic <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ComposeIndexes</span> i1 i2<span style="color: #4f97d7;">)</span> a c

<span style="color: #2aa1ae;">-- | Common composition function</span>
<span style="color: #4f97d7; font-weight: bold;">infixr</span> <span style="color: #a45bad;">1</span> <span style="color: #7590db;">&gt;&gt;&gt;</span>
<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">&gt;&gt;&gt;</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">IndexedCategory</span> ic <span style="color: #7590db;">=&gt;</span> ic i1 a b <span style="color: #7590db;">-&gt;</span> ic i2 b c <span style="color: #7590db;">-&gt;</span> ic <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ComposeIndexes</span> i2 i1<span style="color: #4f97d7;">)</span> a c
a <span style="color: #bc6ec5; font-weight: bold;">&gt;&gt;&gt;</span> b <span style="color: #7590db;">=</span> b <span style="color: #7590db;">.</span> a

<span style="color: #4f97d7; font-weight: bold;">infixr</span> <span style="color: #a45bad;">1</span> <span style="color: #7590db;">&lt;&lt;&lt;</span>
<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">&lt;&lt;&lt;</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">IndexedCategory</span> ic <span style="color: #7590db;">=&gt;</span> ic i1 b c <span style="color: #7590db;">-&gt;</span> ic i2 a b <span style="color: #7590db;">-&gt;</span> ic <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">ComposeIndexes</span> i1 i2<span style="color: #4f97d7;">)</span> a c
<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5; font-weight: bold;">&lt;&lt;&lt;</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">=</span> flip <span style="color: #4f97d7;">(</span><span style="color: #7590db;">&gt;&gt;&gt;</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">IndexedCategory</span> ic<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">=&gt;</span> <span style="color: #ce537a; font-weight: bold;">IndexedArrow</span> ic <span style="color: #4f97d7; font-weight: bold;">where</span>
  <span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">DefaultIndex</span> ic <span style="color: #7590db;">::</span> index
  arr <span style="color: #7590db;">::</span> <span style="color: #4f97d7;">(</span>index <span style="color: #7590db;">~</span> <span style="color: #ce537a; font-weight: bold;">DefaultIndex</span> ic<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">=&gt;</span> <span style="color: #4f97d7;">(</span>a <span style="color: #7590db;">-&gt;</span> b<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">-&gt;</span> ic index a b
  first <span style="color: #7590db;">::</span> ic index b c <span style="color: #7590db;">-&gt;</span> ic index <span style="color: #4f97d7;">(</span>b, d<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span>c, d<span style="color: #4f97d7;">)</span>


</pre>
</div>

<p>
These IndexedCategory and IndexedArrow typeclasses can be seen as a more general variant of the normal Category/Arrow, 
since all normal categories/arrows can be lifted to their indexed variant by indexing them by a placeholder type like `()`.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #2aa1ae;">-- | Wrapper to lift normal categories to 'indexed' categories.</span>
<span style="color: #2aa1ae;">-- | We use the singleton kind `()` as 'index'.</span>
<span style="color: #4f97d7; font-weight: bold;">newtype</span> <span style="color: #ce537a; font-weight: bold;">FreeIndexed</span> <span style="color: #4f97d7;">(</span>c <span style="color: #7590db;">::</span> <span style="color: #7590db;">*</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #7590db;">*</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #7590db;">*</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span>single <span style="color: #7590db;">::</span> <span style="color: #bc6ec5; font-weight: bold;">()</span><span style="color: #4f97d7;">)</span> a b <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">FreeIndexed</span> <span style="color: #4f97d7;">{</span> getCategory <span style="color: #7590db;">::</span> c a b <span style="color: #4f97d7;">}</span>


<span style="color: #4f97d7; font-weight: bold;">instance</span> <span style="color: #ce537a; font-weight: bold;">Control.Category.Category</span> c <span style="color: #7590db;">=&gt;</span> <span style="color: #ce537a; font-weight: bold;">IndexedCategory</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">FreeIndexed</span> c<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">where</span>
  <span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">ComposeIndexes</span> a b <span style="color: #7590db;">=</span> '<span style="color: #4f97d7; font-weight: bold;">()</span>
  id <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">FreeIndexed</span> Control.Category.id
  <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">FreeIndexed</span> a<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">.</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">FreeIndexed</span> b<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">FreeIndexed</span> <span style="color: #4f97d7;">(</span>a <span style="color: #7590db;">Control.Category..</span> b<span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">instance</span> <span style="color: #ce537a; font-weight: bold;">Control.Arrow.Arrow</span> c <span style="color: #7590db;">=&gt;</span> <span style="color: #ce537a; font-weight: bold;">IndexedArrow</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">FreeIndexed</span> c<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">where</span>
  <span style="color: #4f97d7; font-weight: bold;">type</span> <span style="color: #ce537a; font-weight: bold;">DefaultIndex</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">FreeIndexed</span> c<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">=</span> '<span style="color: #4f97d7; font-weight: bold;">()</span>
  arr fun <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">FreeIndexed</span> <span style="color: #4f97d7;">(</span>Control.Arrow.arr fun<span style="color: #4f97d7;">)</span>
  first <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">FreeIndexed</span> cat<span style="color: #4f97d7;">)</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">FreeIndexed</span> <span style="color: #4f97d7;">(</span>Control.Arrow.first cat<span style="color: #4f97d7;">)</span>

</pre>
</div>
</div>
</div>
