MonotonicityTypes.org
* Handling multi-parameter functions
:PROPERTIES:
:header-args: :tangle MonotonicityTypes.hs
:END:

We now can perform the composition of Sfuns. However, if we try to build an Sfun that takes more than one parameter,
Haskell will interpret this in its usual, curried, sense, seeing it as an Sfun that takes one parameter,
and returns a new (non-Sfun) function that takes the rest of the parameters.

This is not what we want, because we want the Sfun to be qualified by the tonicity qualifiers of all of its parameter types,
not only the first.


