MonotonicityTypes.html

<div id="outline-container-orgb5623d9" class="outline-2">
<h2 id="orgb5623d9"><span class="section-number-2">4</span> Handling multi-parameter functions</h2>
<div class="outline-text-2" id="text-4">
<p>
We now can perform the composition of Sfuns. However, if we try to build an Sfun that takes more than one parameter,
Haskell will interpret this in its usual, curried, sense, seeing it as an Sfun that takes one parameter,
and returns a new (non-Sfun) function that takes the rest of the parameters.
</p>

<p>
This is not what we want, because we want the Sfun to be qualified by the tonicity qualifiers of all of its parameter types,
not only the first.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Wiebe-Marten Wijnja</p>
<p class="date">Created: 2019-06-09 zo 13:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
